cscott/rain-barrel/esp32-rainbarrel/src/v2rain.cpp
#if defined(RAINPUMP_V2) || defined(RAINGAUGE_V2)
#if defined(RAINPUMP_V2) && defined(RAINGAUGE_V2)
# error Can not define both RAINPUMP_V2 and RAINGAUGE_V2, pick one!
#endif

#define MOTOR_DRIVER_CONNECTED
#define FLOWMETER_CONNECTED
//#define ADC_CONNECTED
#undef DEV_MODE // shorter delays for easier development

#include "Arduino.h"
#include <Wire.h>
#include <AsyncDelay.h>

#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266mDNS.h>
#include <ArduinoOTA.h>
#include <Adafruit_GFX.h>

#include <Adafruit_MQTT.h>
#include <Adafruit_MQTT_Client.h>
#include <ArduinoJson.h>
#include <AsyncDelay.h>
#include "config.h"
#include "bluehigh-12px.h"
#include "bluebold-14px.h"
#include "icons.h"

// V2 hardware features
#include "st7529.h"
#include "cap1298.h"
// also adp1650.h, but that's not working yet
// V2 pin assignments
#define LCD_RST         2 // F0 / GPIO  2 => LCD_RST (out)
#define PRESSURE_SW    16 // F1 / GPIO 16 => Pressure switch (in)
#define PUMP_CNTRL      0 // F2 / GPIO  0 => Pump (out)
#define LCD_CS         15 // F3 / GPIO 15 => LCD_CS (out)
#define LCD_MOSI       13 // F4 / GPIO 13 => LCD_MOSI (out)
#define WATER_SENSE    10 // F5 / GPIO 12 => Water sensor (in)
#define LCD_SCK        14 // F6 / GPIO 14 => LCD_SCK

#ifdef RAIN_SERVER_v2
# include <Adafruit_MotorShield.h>
# include "flowmeter.h"
# include "smrtysnitch.h"
# include "smrty_decode.h"
#endif
#ifdef RAINGAUGE_V2
# include <ESP8266HTTPClient.h>
#ifdef ADC_CONNECTED
# include <Adafruit_ADS1X15.h>
#endif
#endif

#define SERVER_MDNS_NAME "rainpump"
#define CLIENT_MDNS_NAME "raingauge"
#define WATER_ALARM_LOW 100 /* 10% */
#define KEEPALIVE_INTERVAL_SECS 60
#define LEVEL_SENSOR_INTERVAL_SECS 1
#define SERVER_PORT 80
#define WATER_READING_ZERO 0
// (old) rain barrel 1 max observed 17194 rain barrel 2 got up to 17414
// (new adc) around 32000 seems to be full, measured up to 32751 in testing
#define WATER_READING_FULL 32000
// From datasheet: "Frequency(Hz) = (8.1Q) -3 +/- 10% where Q is L/min"
// So if G(gallons/min) = Q/3.78541
// 1 gal/s = 60 gal/min = 227.1246 L/min => 1839.7-3 ~= 1837Hz
// We count both transitions, so 3673.4 ticks per gallon.
#define TICKS_PER_GALLON 3673.4

#define COLOR1 0x00 // was: EPD_WHITE
#define COLOR2 0xA0 // was: EPD_LIGHT
#define COLOR3 0xC0 // was: EPD_DARK
#define COLOR4 0xFF // was: EPD_BLACK

// General note: Most (or all?) of the intervals below have small offsets added
// to make the interval a prime # of milliseconds.  This ensures that intervals
// will tend to space themselves out over time and not all pile up at the same
// millisecond boundary.

ST7529_LCD display = ST7529_LCD();

AsyncDelay displayMaxRefresh = AsyncDelay(4 * 60 * 60 * 1000 + 11, AsyncDelay::MILLIS); // 6x a day need it or not
AsyncDelay displayMinRefresh = AsyncDelay(13, AsyncDelay::MILLIS); // no more than once/10ms seconds

struct ButtonPress {
  ButtonPress(): a(false), b(false), c(false), d(false), prox(false) {}
  boolean a : 1;
  boolean b : 1;
  boolean c : 1;
  boolean d : 1;
  boolean prox : 1;
  bool operator==(const ButtonPress& rhs) const {
    return a == rhs.a && b == rhs.b && c == rhs.c && d == rhs.d && prox == rhs.prox;
  }
};
ButtonPress lastButtonPress;

AsyncDelay debounceDelay = AsyncDelay(250 + 1, AsyncDelay::MILLIS); // switch debounce
#ifdef RAINGAUGE_V2
AsyncDelay capReadInterval = AsyncDelay(50 + 3, AsyncDelay::MILLIS); // read @ 20Hz
#endif

// WiFiClientSecure for SSL/TLS support
WiFiClientSecure client;
// Setup the MQTT client class by passing in the WiFi client and MQTT server and login details
Adafruit_MQTT_Client mqtt(&client, AIO_SERVER, AIO_SERVERPORT, AIO_USERNAME, AIO_KEY);
AsyncDelay mqttDelay = AsyncDelay(5000 + 3, AsyncDelay::MILLIS); // retry every 5 seconds if not connected

// io.adafruit.com root CA
const char* adafruitio_root_ca = \
    "-----BEGIN CERTIFICATE-----\n" \
    "MIIDrzCCApegAwIBAgIQCDvgVpBCRrGhdWrJWZHHSjANBgkqhkiG9w0BAQUFADBh\n" \
    "MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3\n" \
    "d3cuZGlnaWNlcnQuY29tMSAwHgYDVQQDExdEaWdpQ2VydCBHbG9iYWwgUm9vdCBD\n" \
    "QTAeFw0wNjExMTAwMDAwMDBaFw0zMTExMTAwMDAwMDBaMGExCzAJBgNVBAYTAlVT\n" \
    "MRUwEwYDVQQKEwxEaWdpQ2VydCBJbmMxGTAXBgNVBAsTEHd3dy5kaWdpY2VydC5j\n" \
    "b20xIDAeBgNVBAMTF0RpZ2lDZXJ0IEdsb2JhbCBSb290IENBMIIBIjANBgkqhkiG\n" \
    "9w0BAQEFAAOCAQ8AMIIBCgKCAQEA4jvhEXLeqKTTo1eqUKKPC3eQyaKl7hLOllsB\n" \
    "CSDMAZOnTjC3U/dDxGkAV53ijSLdhwZAAIEJzs4bg7/fzTtxRuLWZscFs3YnFo97\n" \
    "nh6Vfe63SKMI2tavegw5BmV/Sl0fvBf4q77uKNd0f3p4mVmFaG5cIzJLv07A6Fpt\n" \
    "43C/dxC//AH2hdmoRBBYMql1GNXRor5H4idq9Joz+EkIYIvUX7Q6hL+hqkpMfT7P\n" \
    "T19sdl6gSzeRntwi5m3OFBqOasv+zbMUZBfHWymeMr/y7vrTC0LUq7dBMtoM1O/4\n" \
    "gdW7jVg/tRvoSSiicNoxBN33shbyTApOB6jtSj1etX+jkMOvJwIDAQABo2MwYTAO\n" \
    "BgNVHQ8BAf8EBAMCAYYwDwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQUA95QNVbR\n" \
    "TLtm8KPiGxvDl7I90VUwHwYDVR0jBBgwFoAUA95QNVbRTLtm8KPiGxvDl7I90VUw\n" \
    "DQYJKoZIhvcNAQEFBQADggEBAMucN6pIExIK+t1EnE9SsPTfrgT1eXkIoyQY/Esr\n" \
    "hMAtudXH/vTBH1jLuG2cenTnmCmrEbXjcKChzUyImZOMkXDiqw8cvpOp/2PV5Adg\n" \
    "06O/nVsJ8dWO41P0jmP6P6fbtGbfYmbW0W5BjfIttep3Sp+dWOIrWcBAI+0tKIJF\n" \
    "PnlUkiaY4IBIqDfv8NZ5YBberOgOzW6sRBc4L0na4UU+Krk2U886UAb3LujEV0ls\n" \
    "YSEY1QSteDwsOoBrp+uvFRTp2InBuThs4pFsiv9kuXclVzDAGySj4dzp30d8tbQk\n" \
    "CAUw7C29C79Fv1C5qfPrmAESrciIxpg0X40KPMbp1ZWVbd4=\n" \
    "-----END CERTIFICATE-----\n";
/****************************** Feeds ***************************************/

// Setup a feed called 'test' for publishing.
// Notice MQTT paths for AIO follow the form: <username>/feeds/<feedname>
#define FEED_PREFIX AIO_USERNAME "/feeds/rain-barrels."
#ifdef RAINPUMP_V2
AsyncDelay valveStateFeedMaxDelay = AsyncDelay(60*60*1000 + 1, AsyncDelay::MILLIS); // at least 1/hr
AsyncDelay valveStateFeedMinDelay = AsyncDelay(1000 + 13, AsyncDelay::MILLIS); // not more than 1/second
Adafruit_MQTT_Publish valveStateFeed = Adafruit_MQTT_Publish(&mqtt, FEED_PREFIX "water-source");
#endif
#ifdef RAINGAUGE_V2
// 11s so they don't hit at the same time as the SMRT-Y poll, which is 9s
AsyncDelay waterLevelFeedDelay = AsyncDelay(11*1000 + 3, AsyncDelay::MILLIS); // every ~10s
Adafruit_MQTT_Publish waterLevel1Feed = Adafruit_MQTT_Publish(&mqtt, FEED_PREFIX "waterlevel1");
Adafruit_MQTT_Publish waterLevel2Feed = Adafruit_MQTT_Publish(&mqtt, FEED_PREFIX "waterlevel2");
#endif

#ifdef RAINPUMP_V2
# define MDNS_NAME SERVER_MDNS_NAME
#endif
#ifdef RAINGAUGE_V2
# define MDNS_NAME CLIENT_MDNS_NAME
#endif

AsyncDelay connectionWatchdog = AsyncDelay(5*60*1000 + 7, AsyncDelay::MILLIS);

#ifdef RAINPUMP_V2
// Motorshield configuration
Adafruit_MotorShield AFMS = Adafruit_MotorShield();
Adafruit_DCMotor *cityValve = AFMS.getMotor(1);
Adafruit_DCMotor *ground1 = AFMS.getMotor(2);
Adafruit_DCMotor *ground2 = AFMS.getMotor(3);
Adafruit_DCMotor *pump = AFMS.getMotor(4);

