cscott/rain-barrel/esp32-rainbarrel/src/v2rain.cpp
WebServer server(SERVER_PORT);
AsyncDelay lastPing = AsyncDelay(3 * KEEPALIVE_INTERVAL_SECS * 1000  + 1, AsyncDelay::MILLIS);
// The valve seems to get hot if you keep it activated -- though it should not!  Anyway, only
// run the valve for a minute when it changes state.
int lastValveState = -1;
AsyncDelay valveRunLength = AsyncDelay(60 * 1000 + 13, AsyncDelay::MILLIS);

// This interval is offset just a smidge because we ideally want to bin the
// flow per minute. But being .002% too high shouldn't matter.
// But do try to generate at least 1 data point per day
uint64_t lastFlowMeterReading = 0;
bool lastFlowMeterReadingValid = false;
AsyncDelay flowMeterInterval = AsyncDelay(60 * 1000 - 1, AsyncDelay::MILLIS);
AsyncDelay flowMeterIntervalMax = AsyncDelay(24 * 60 * 60 * 1000 - 7, AsyncDelay::MILLIS);
Adafruit_MQTT_Publish flowMeterFeed = Adafruit_MQTT_Publish(&mqtt, FEED_PREFIX "irrigation-flow");

Adafruit_MQTT_Publish smrtyRawFeed = Adafruit_MQTT_Publish(&mqtt, FEED_PREFIX "smrty-raw");
Adafruit_MQTT_Publish soilMoistureFeed = Adafruit_MQTT_Publish(&mqtt, FEED_PREFIX "smrty-moisture");
Adafruit_MQTT_Publish soilTemperatureFeed = Adafruit_MQTT_Publish(&mqtt, FEED_PREFIX "smrty-temperature");
// This is polling delay; it is also minimum MQTT publish interval so we don't
// get throttled.
// 9s so they don't hit at the same time as the water level poll, which is 11s
AsyncDelay smrtyInterval = AsyncDelay(9 * 1000 + 1, AsyncDelay::MILLIS);
uint8_t smrtyLastSeqno = 0xFF;
#endif

#ifdef RAINGAUGE_V2
#ifdef ADC_CONNECTED
Adafruit_ADS1115 ads1115;
#endif
AsyncDelay lastLevelReading = AsyncDelay(100, AsyncDelay::MILLIS);
AsyncDelay lastPing = AsyncDelay(KEEPALIVE_INTERVAL_SECS * 1000 - 1, AsyncDelay::MILLIS);
String serverBaseUrl = String("http://" SERVER_MDNS_NAME ".local:80/update");

// It would really be nice if we could do this filtering on the analog
// side instead of the digital side... (we tried!)
// Actually - one of our sensors is much noisier than the other! HW issue?
#define LEVEL_SAMPLE_FILTER 4
int32_t level_accum[2] = { 0, 0 };
#endif

enum PumpState {
  STATE_CITY = 0,
  STATE_AUTO = 1,
  STATE_RAIN = 2,
};

typedef struct SystemState {
  int user_state; // State selected via the UI
  int active_state; // Running state (ie, not 'auto')
  boolean connected_recently;
  boolean pipe_water_present;
  int water_level[2];
} SystemState;

bool state_equal(SystemState *a, SystemState *b) {
  if (a->user_state != b->user_state) {
    return false;
  }
  if (a->active_state != b->active_state) {
    return false;
  }
  if (a->connected_recently != b->connected_recently) {
    return false;
  }
  if (a->pipe_water_present != b->pipe_water_present) {
    return false;
  }
  for (int i = 0; i < 2; i++) {
    // we'll call them equal if they are "close enough" (aka 10 counts)
    int diff = a->water_level[i] - b->water_level[i];
    if (diff < -10 || diff > +10) {
      return false;
    }
  }
  return true;
}

SystemState state = {
  STATE_AUTO,
  STATE_CITY,
  false,
  false,
  { 560, 630 },
};
SystemState last_displayed_state = state;
#ifdef RAINGAUGE_V2
SystemState last_xmit_state = state;
#endif

void updateState();

void normalface() {
  display.setFont(&bluehigh12pt7b);
}

void boldface() {
  display.setFont(&bluebold14pt7b);
}

#ifdef RAINPUMP_V2
// Web server
void handleRoot() {
  char temp[800];
  int sec = millis() / 1000;
  int min = sec / 60;
  int hr = min / 60;

  snprintf(temp, 800,

           "<html>\n"
"  <head>\n"
"    <meta http-equiv='refresh' content='10'/>\n"
"    <title>Rainbarrel Pump Manager</title>\n"
"    <style>\n"
"      body { background-color: #fff; font-family: Arial, Helvetica, Sans-Serif; Color: #000088; }\n"
"    </style>\n"
"  </head>\n"
"  <body>\n"
"    <h1>Rainbarrel Pump Manager</h1>\n"
"    <p><a href='https://io.adafruit.com/cscott/dashboards/griggs-corner-rain-barrels?kiosk=true'>Dashboard</a></p>\n"
"    <p>Uptime: %02d:%02d:%02d</p>\n"
"    <p>User mode: %s %s %s</p>\n"
"    <p>Active water source: %s</p>\n"
"    <pre>%3d.%d%% %3d.%d%%</pre>\n"
"    <p>Contacted recently by rain gauge: %s</p>\n"
"    <img src=\"/test.svg\" />\n"
"  </body>\n"
"</html>",

           hr, min % 60, sec % 60,
           state.user_state == STATE_CITY ? "<b>CITY</b>" : "<a href='/update?state=0'>city</a>",
           state.user_state == STATE_AUTO ? "<b>AUTO</b>" : "<a href='/update?state=1'>auto</a>",
           state.user_state == STATE_RAIN ? "<b>RAIN</b>" : "<a href='/update?state=2'>rain</a>",
           state.active_state == STATE_CITY ? "City water" : "Rain barrels",
           state.water_level[0]/10, state.water_level[0]%10,
           state.water_level[1]/10, state.water_level[1]%10,
           state.connected_recently ? "Yes" : "No"
          );
  server.send(200, "text/html", temp);
}

void handleUpdate() {
  // update level sensors
  boolean changedState = false;
  for (uint8_t i = 0; i < server.args(); i++) {
    if (server.argName(i) == "level1") {
      state.water_level[0] = server.arg(i).toInt();
      lastPing.restart();
    }
    if (server.argName(i) == "level2") {
      state.water_level[1] = server.arg(i).toInt();
      lastPing.restart();
    }
    if (server.argName(i) == "state") {
      state.user_state = server.arg(i).toInt();
      if (state.user_state < STATE_CITY || state.user_state > STATE_RAIN) {
        state.user_state = STATE_AUTO;
      }
      changedState = true;
    }
  }
  if (changedState) {
    updateState(); // update active state to match new user state
  }
  // output our current state
  StaticJsonDocument<96> doc;
  doc["user_state"] = state.user_state;
  doc["active_state"] = state.active_state;
  doc["pipe_water_present"] = state.pipe_water_present;
  JsonArray water_level = doc.createNestedArray("water_level");
  water_level.add(state.water_level[0]);
  water_level.add(state.water_level[1]);
  String out = "";
  serializeJson(doc, out);
  server.send(200, "text/json", out);
}

void handleNotFound() {
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";

  for (uint8_t i = 0; i < server.args(); i++) {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }

  server.send(404, "text/plain", message);
}

void drawGraph() {
  String out;
  out.reserve(2600);
  char temp[70];
  out += "<svg xmlns=\"http://www.w3.org/2000/svg\" version=\"1.1\" width=\"400\" height=\"150\">\n";
  out += "<rect width=\"400\" height=\"150\" fill=\"rgb(250, 230, 210)\" stroke-width=\"1\" stroke=\"rgb(0, 0, 0)\" />\n";
  out += "<g stroke=\"black\">\n";
  int y = rand() % 130;
  for (int x = 10; x < 390; x += 10) {
    int y2 = rand() % 130;
    sprintf(temp, "<line x1=\"%d\" y1=\"%d\" x2=\"%d\" y2=\"%d\" stroke-width=\"1\" />\n", x, 140 - y, x + 10, 140 - y2);
    out += temp;
    y = y2;
  }
  out += "</g>\n</svg>\n";

  server.send(200, "image/svg+xml", out);
}

bool readFlowMeter(uint64_t *result) {
    uint64_t count = 0;
#ifdef FLOWMETER_CONNECTED
    uint8_t nBytes = Wire.requestFrom(FLOWMETER_I2C_ADDR, 8);
    for (int i=0; Wire.available() > 0 && i<8; i++) {
        count |= ((uint64_t)Wire.read()) << (8*i);
    }
    while (Wire.available() > 0) {
        Wire.read();
    }
    *result = count;
    return (nBytes >= 8);
#endif
    return false;
}

