cscott/rain-barrel/esp32-rainbarrel/src/v2rain.cpp
bool readSmrtySnitch(uint8_t which, uint8_t *seqno, struct smrty_msg *msg, uint8_t *good_checksum) {
    Wire.beginTransmission(SNITCH_I2C_ADDR);
    Wire.write(which);
    uint8_t status = Wire.endTransmission();
    if (status != 0) {
        return false; // no response from client, must be disconnected
    }
    uint8_t reg, nBytes;
    do {
        nBytes = Wire.requestFrom(SNITCH_I2C_ADDR, 10);
        if (nBytes == 0) {
            return false; /* unexpected! */
        }
        reg = Wire.read();
    } while (reg != which);  // busy loop until reg. write is done
    if (nBytes < 10) {
        return false; /* incomplete read for some reason */
    }
    *seqno = Wire.read();
    uint8_t checksum = 0;
    uint8_t *p = (uint8_t*)msg;
    for (int i=0; i<8; i++, p++) {
        *p = Wire.read();
        if (i<7) {
            checksum += *p;
        }
    }
    *good_checksum = (checksum == msg->checksum) ? 1 : 0;
    return true;
}

void publishSmrty(uint8_t seqno, struct smrty_msg *msg, bool good_checksum) {
    const char *fmt = "[%02X] %02X %02X %02X %02X | %02X %02X %02X | %02X%s";
    char buf[strlen(fmt)+1]; // string will be shorter than this
    snprintf(buf, strlen(fmt)+1, fmt, seqno,
             msg->addr, msg->cmd, msg->tx_data1, msg->tx_data2,
             msg->rx_data1, msg->rx_data2, msg->status,
             msg->checksum, good_checksum ? "":"*");
    smrtyRawFeed.publish(buf);
    if (!good_checksum) { return; }
    // Do our best to decode these values.
    uint16_t tx_data = ((uint16_t)msg->tx_data2)<<8 | msg->tx_data1;
    uint16_t rx_data = ((uint16_t)msg->rx_data2)<<8 | msg->rx_data1;
    switch (tx_data) {
    case 0x000B:
        soilMoistureFeed.publish(((float)rx_data)/100.0);
        break;
    case 0x0005:
        // This could use more points to do a proper line fit
        // (This one done at https://mycurvefit.com/)
        soilTemperatureFeed.publish(33.1877 + (rx_data*.1089572));
        break;
    case 0x000E:
        // This is electrical conductivity, but it's always 0.0, so ignore it.
        break;
    default:
        break;
    }
}

bool pollSmrtySnitch(void) {
    struct smrty_msg read_msgs[SNITCH_BUFFER_SIZE];
    uint8_t read_seqno[SNITCH_BUFFER_SIZE];
    uint8_t read_good_checksum[SNITCH_BUFFER_SIZE];
    bool status;
    int i;
    for (i=0; i<SNITCH_BUFFER_SIZE; i++) {
        status = readSmrtySnitch(i, &read_seqno[i], &read_msgs[i], &read_good_checksum[i]);
        if (!status) {
            return false; // communications error, bail.
        }
        if (read_seqno[i] == 0xFF /* uninitialized */ ||
            read_seqno[i] == smrtyLastSeqno) {
            // we found one we already transmitted, don't need to fetch more
            break;
        }
    }
    // ok, transmit up to item i.
    for (--i; i>=0; i--) {
        publishSmrty(read_seqno[i], &read_msgs[i], read_good_checksum[i]);
        smrtyLastSeqno = read_seqno[i];
        return true; // This ensures that we don't get throttled by Adafruit IO
    }
    return true;
}

#endif

bool cap1298_write(uint8_t regno, uint8_t val) {
    Wire.beginTransmission(CAP1298_I2C_ADDR);
    Wire.write(regno);
    Wire.write(val);
    uint8_t status = Wire.endTransmission();
    if (status != 0) {
        return false;
    }
    return true;
}
bool cap1298_read(uint8_t regno, uint8_t *val) {
    Wire.beginTransmission(CAP1298_I2C_ADDR);
    Wire.write(regno);
    uint8_t status = Wire.endTransmission();
    if (status != 0) {
        return false;
    }
    uint8_t nBytes = Wire.requestFrom(CAP1298_I2C_ADDR, 1);
    if (nBytes == 0) {
        return false;
    }
    *val = Wire.read();
    return true;
}

void cap1298_setup() {
    // CAP1298 setup
    // main control => combo mode, active gain=1, standby gain=8
    cap1298_write(CAP1298_REG_MAIN_CONTROL, 0x0E);
    // No multitouch limiting
    cap1298_write(CAP1298_REG_MULTI_TOUCH_CONFIG, 0x00);
    // No repeating interrupts
    cap1298_write(CAP1298_REG_REPEAT_ENABLE, 0x00);
    // No signal guard (default value). CS5 was supposed to be guard for CS6,
    // but as it turns out CS6 has too large a capacitance to be used.
    cap1298_write(CAP1298_REG_SIGNAL_GUARD_ENABLE, 0x00);
    // Enable CS1-CS4 in "active" mode.
    cap1298_write(CAP1298_REG_SENSOR_INPUT_ENABLE, 0x0F);
    // Default 32x sensitivity for active mode. (bump to 1F or 0F for more sens.)
    cap1298_write(CAP1298_REG_SENSITIVITY_CONTROL, 0x2F);
    // Default averaging and sensing cycle time for active channels
    cap1298_write(CAP1298_REG_SAMPLING_CONFIG, 0x39);
    // Enable CS5 in "standby" mode (CS6 is unusable)
    cap1298_write(CAP1298_REG_STANDBY_CHANNEL, 0x10);
    // Default averaging and sensing cycle time for standby channels
    cap1298_write(CAP1298_REG_STANDBY_CONFIG, 0x39);
    // Maximum 128x sensitivity for standby channels.
    cap1298_write(CAP1298_REG_STANDBY_SENSITIVITY, 0x00);
    // Gain adj: CS1=1, CS2=1, CS3=2, CS4=2
    cap1298_write(CAP1298_REG_CALIBRATION_SENSITIVITY1, 0x50);
    // Gain adj: CS5=1 CS6=1 CS7=1 CS8=1
    cap1298_write(CAP1298_REG_CALIBRATION_SENSITIVITY2, 0x00);
    // Recalibrate all channels now.
    cap1298_write(CAP1298_REG_CALIBRATION, 0x1F);
}

void cap1298_read_buttons(ButtonPress *bp) {
    uint8_t val;
    if (!cap1298_read(CAP1298_REG_SENSOR_STATUS, &val)) {
        return;
    }
    if (val & 0x01) {
        bp->a = true;
    }
    if (val & 0x02) {
        bp->b = true;
    }
    if (val & 0x04) {
        bp->c = true;
    }
    if (val & 0x08) {
        bp->d = true;
    }
    if (val & 0x10) {
        bp->prox = true;
    }
}

void setup() {
    Wire.begin();
    Serial.begin(115200);
    Serial.println("Setup!");
    // initialize built in LED pin as an output.
    pinMode(LED_BUILTIN, OUTPUT);
    digitalWrite(LED_BUILTIN, HIGH);

    pinMode(WATER_SENSE, INPUT_PULLUP);
    pinMode(PRESSURE_SW, INPUT_PULLUP);
    pinMode(PUMP_CNTRL, OUTPUT);

    digitalWrite(LCD_CS, 1);
    pinMode(LCD_CS, OUTPUT);
    digitalWrite(LCD_RST, 0);
    pinMode(LCD_RST, OUTPUT);

    Serial.println("WiFi setup");
    // Wifi Setup
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASS);

    Serial.println("cap1298 setup");
    cap1298_setup();

#ifdef RAINPUMP_V2
#ifdef MOTOR_DRIVER_CONNECTED
    // Motorshield Setup
    Serial.println("Motorshield setup");
    AFMS.begin();
    // This should ground all outputs
    cityValve->setSpeed(0); cityValve->run(FORWARD);
    ground1->setSpeed(0); ground1->run(FORWARD);
    ground2->setSpeed(0); ground2->run(FORWARD);
    pump->setSpeed(0); pump->run(FORWARD);
#endif
#endif

