cscott/rain-barrel/esp32-rainbarrel/src/v2rain.cpp
#ifdef RAINGAUGE_V2
#ifdef ADC_CONNECTED
    Serial.println("ADC setup");
    ads1115.begin(0x48); // At default address
    ads1115.setGain(GAIN_TWO); // +/-2.048V
#endif
#endif

    Serial.println("Display setup");
    display.begin();
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(COLOR4);
    boldface();
    display.setCursor(0, 20);
    display.println(MDNS_NAME);
    normalface();
    display.setTextWrap(true);
    display.print("Connecting to SSID: ");
    display.println(WIFI_SSID);
    Serial.println("About to display");
    display.display();

    Serial.println("Booting");

    // Wait for connection
    int timeout = 0;
    while (WiFi.status() != WL_CONNECTED) {
        delay(500);
        Serial.print(".");
        timeout++;
        if (timeout > 60) {
            Serial.println("Connection Failed! Rebooting...");
            ESP.restart();
        }
    }
    display.print("IP: ");
    display.println(WiFi.localIP());
    display.display();

    bool mdns_success = false;
    if (MDNS.begin(MDNS_NAME)) {
        mdns_success = true;
        Serial.println("MDNS responder started: " MDNS_NAME);
        display.println("mDNS: " MDNS_NAME);
        display.display();
    }

    // Set Adafruit IO's root CA
    // client.setCACert(adafruitio_root_ca); // XXX

    ArduinoOTA.setHostname(MDNS_NAME);
    ArduinoOTA.setPassword(OTA_PASSWD);
    ArduinoOTA
    .onStart([]() {
        String type;
        digitalWrite(LED_BUILTIN, LOW);
        if (ArduinoOTA.getCommand() == U_FLASH)
            type = "sketch";
        else // U_SPIFFS
            type = "filesystem";

        // NOTE: if updating SPIFFS this would be the place to unmount SPIFFS using SPIFFS.end()
        Serial.println("Start updating " + type);
    });
    ArduinoOTA.onEnd([]() {
        Serial.println("\nEnd");
    });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
    });
    ArduinoOTA.onError([](ota_error_t error) {
        Serial.printf("Error[%u]: ", error);
        if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
        else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
        else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
        else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
        else if (error == OTA_END_ERROR) Serial.println("End Failed");
    });

    ArduinoOTA.begin();

#ifdef RAINGAUGE_V2
    // Find the pump server
    int n = MDNS.queryService("http", "tcp");
    for (int i = 0; i < n; i++) {
        Serial.print("  ");
        Serial.print(i + 1);
        Serial.print(": ");
        Serial.print(MDNS.hostname(i));
        Serial.print(" (");
        Serial.print(MDNS.IP(i));
        Serial.print(":");
        Serial.print(MDNS.port(i));
        Serial.println(")");
        if (MDNS.hostname(i) == "rainpump") {
            serverBaseUrl.remove(0);
            serverBaseUrl += "http://";
            serverBaseUrl += MDNS.IP(i).toString();
            serverBaseUrl += ":";
            serverBaseUrl += MDNS.port(i);
            serverBaseUrl += "/update";
            Serial.print("rainpump found: ");
            Serial.println(serverBaseUrl);
        }
    }
    for (int i=0; i<2; i++) {
        level_accum[i] = 0;
#ifdef ADC_CONNECTED
        for (int j=0; j<LEVEL_SAMPLE_FILTER; j++) {
            level_accum[i] += ads1115.readADC_SingleEnded(i);
        }
#endif
    }
#endif

#ifdef RAINPUMP_V2
    server.on("/", handleRoot);
    server.on("/test.svg", drawGraph);
    server.on("/inline", []() {
        server.send(200, "text/plain", "this works as well");
    });
    server.on("/update", handleUpdate);
    server.onNotFound(handleNotFound);
    server.begin();
    MDNS.addService("http", "tcp", SERVER_PORT);
    Serial.println("HTTP server started");
    valveRunLength.restart(); // run the valve to move it
    lastFlowMeterReadingValid = readFlowMeter(&lastFlowMeterReading);
    flowMeterInterval.restart(); // next read the flow meter in a minute
    flowMeterIntervalMax.expire(); // report the first reading regardless
#endif

    Serial.println("Ready");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
    displayMaxRefresh.expire();
    displayMinRefresh.expire();
    lastPing.expire();
    connectionWatchdog.restart();
}

#ifdef RAINGAUGE_V2
void sendUpdate(int new_user_state = -1) {
  state.connected_recently = false;
  // test client
  HTTPClient http;
  String url2 = serverBaseUrl;
  url2 += "?level1=";
  url2 += state.water_level[0];
  url2 += "&level2=";
  url2 += state.water_level[1];
  if (new_user_state >= STATE_CITY && new_user_state <= STATE_RAIN) {
    url2 += "&state=";
    url2 += new_user_state;
  }
  //Serial.println(url2);
  http.begin(client, url2);
  int httpCode = http.GET();
  if (httpCode == HTTP_CODE_OK) {
    StaticJsonDocument<192> root;
    DeserializationError error = deserializeJson(root, http.getStream());
    if (error) {
      Serial.print(F("deserializeJson failed: "));
      Serial.println(error.f_str());
    } else {
      state.user_state = root["user_state"];
      state.active_state = root["active_state"];
      state.pipe_water_present = root["pipe_water_present"];
      state.connected_recently = true;
      connectionWatchdog.restart();
      Serial.printf("Got user_state %d\n", state.user_state);
    }
  }
  http.end();
  lastPing.restart();
  last_xmit_state = state;
}
#endif

void updateState() {
#ifdef RAINGAUGE_V2
  if (lastLevelReading.isExpired()) {
    // use .repeat() to ensure our filter bandwidth is relatively constant
    // even if there's a (slow) display refresh between samples
    lastLevelReading.repeat();
    int32_t raw_level[2];
    for (int i=0; i<2; i++) {
      level_accum[i] =
        ((int64_t)level_accum[i] * (LEVEL_SAMPLE_FILTER-1) / LEVEL_SAMPLE_FILTER)
#ifdef ADC_CONNECTED
        + ads1115.readADC_SingleEnded(i)
#endif
          ;
      raw_level[i] = level_accum[i] / LEVEL_SAMPLE_FILTER;
      state.water_level[i] = (raw_level[i] - WATER_READING_ZERO) * 1000
        / (WATER_READING_FULL - WATER_READING_ZERO);
      if (state.water_level[i] < 0) {
        state.water_level[i] = 0;
      }
      if (state.water_level[i] > 1000) {
        state.water_level[i] = 1000;
      }
#ifdef DEV_MODE
      // XXX avoid cycling the valves in auto mode while we're testing
      if (state.water_level[i] <= WATER_ALARM_LOW) {
        state.water_level[i] = WATER_ALARM_LOW+1;
      }
#endif
    }
    // periodically send levels to AIO
    if (waterLevelFeedDelay.isExpired() && mqtt.connected()) {
      // publishing raw levels for now, for calibration purpoes
      waterLevel1Feed.publish(raw_level[0]/*state.water_level[0]*/);
      waterLevel2Feed.publish(raw_level[1]/*state.water_level[1]*/);
      waterLevelFeedDelay.restart();
    }
  }
  if (lastPing.isExpired() || !state_equal(&state, &last_xmit_state)) {
    // send our levels to the server via a GET request and update our copy of the server state
    sendUpdate();
  }
#endif
#ifdef RAINPUMP_V2
  // read flow meter at intervals
  if (flowMeterInterval.isExpired()) {
    flowMeterInterval.repeat();
    if (mqtt.connected()) {
        uint64_t newFlow;
        bool valid = readFlowMeter(&newFlow);
        if (!valid) {
            lastFlowMeterReadingValid = false;
        } else if (!lastFlowMeterReadingValid) {
            lastFlowMeterReading = newFlow;
            lastFlowMeterReadingValid = true;
        } else {
            double gallons = (newFlow - lastFlowMeterReading) / (double)TICKS_PER_GALLON;
            // don't fill the log with a lot of unnecessary zeroes
            if (newFlow != lastFlowMeterReading ||
                flowMeterIntervalMax.isExpired()) {
                if (flowMeterFeed.publish(gallons)) {
                    lastFlowMeterReading = newFlow;
                    flowMeterIntervalMax.repeat();
                }
            }
        }
    }
  }
  // read the SMRTY snitch at interval
  if (smrtyInterval.isExpired()) {
      smrtyInterval.restart();
      if (mqtt.connected()) {
          pollSmrtySnitch();
      }
  }
  // read our pipe water sensor
  state.pipe_water_present = !digitalRead(WATER_SENSE);

