cscott/rain-barrel/esp32-rainbarrel/src/v2rain.cpp
  // implement "auto" mode
  if (state.user_state != STATE_AUTO) {
    // force a specific state
    state.active_state = state.user_state;
  } else {
    boolean is_rain_empty = !state.pipe_water_present;
    if (state.connected_recently && !is_rain_empty) { // use rain barrel levels
      is_rain_empty = (state.water_level[0] <= WATER_ALARM_LOW || state.water_level[1] <= WATER_ALARM_LOW);
    }
    // in auto
    if ( is_rain_empty ) {
      state.active_state = STATE_CITY;
    } else {
      state.active_state = STATE_RAIN;
    }
  }
  state.connected_recently = !lastPing.isExpired();
#ifdef MOTOR_DRIVER_CONNECTED
  // ok, now adjust settings to match selected state
  if (state.active_state == STATE_CITY) {
    // pump off
    pump->setSpeed(0);
    // move value to 'city'
    cityValve->run(FORWARD);
    if (lastValveState != STATE_CITY) {
      lastValveState = STATE_CITY;
      valveStateFeedMaxDelay.expire();

      cityValve->setSpeed(255);
      valveRunLength.restart();
    }
  } else {
    // move valve to 'rain'
    cityValve->run(BACKWARD);
    if (lastValveState != STATE_RAIN) {
      lastValveState = STATE_RAIN;
      valveStateFeedMaxDelay.expire();

      cityValve->setSpeed(255);
      valveRunLength.restart();
    }
    // turn pump on
    pump->setSpeed(255);
  }
  if (valveRunLength.isExpired()) {
    cityValve->setSpeed(0);
  }
#endif
  if (valveStateFeedMaxDelay.isExpired() && valveStateFeedMinDelay.isExpired() && mqtt.connected()) {
    valveStateFeed.publish( state.active_state == STATE_CITY ? "building-o" : "w:raindrops" );
    // don't reset valveStateFeedDelay, we don't need to periodically send this.
    valveStateFeedMinDelay.restart();
    valveStateFeedMaxDelay.restart();
  }
#endif
}

// centered in both x and y
void centerjustify(const char *str) {
  int16_t x1, y1;
  uint16_t w, h;
  display.getTextBounds(str, 0, 0, &x1, &y1, &w, &h);
  display.setCursor(display.getCursorX() - (w / 2), display.getCursorY() + (h / 2));
  display.print(str);
}

void rightjustify(const char *str) {
  int16_t x1, y1;
  uint16_t w, h;
  display.getTextBounds(str, 0, 0, &x1, &y1, &w, &h);
  display.setCursor(display.getCursorX() - w - 1, display.getCursorY());
  display.print(str);
}

void updateDisplay() {
  // eInk display update
  if (state_equal(&state, &last_displayed_state) && !displayMaxRefresh.isExpired()) {
    return; // don't update if nothing has changed
  }

  if (!displayMinRefresh.isExpired()) {
    return; // don't update too frequently
  }
  displayMinRefresh.restart();
  displayMaxRefresh.restart();
  last_displayed_state = state;

  boolean client_connected_recently = true;
#ifdef RAINGAUGE_V2
  client_connected_recently = state.connected_recently;
#endif

  display.clearDisplay();
  normalface();
  display.setTextColor(COLOR3);
  display.setCursor(4, 17);
  display.setTextSize(1);
  display.print(WiFi.localIP());
  display.setCursor(display.width() - 4, 17);
  rightjustify(MDNS_NAME ".local");

#define BAR_TOP 26
#define BAR_HEIGHT (53-26)
#define BAR_WIDTH (256-38)
#define BAR_SPACE (63-26)
  for (int i = 0; i < 2; i++) {
    int x = display.width() / 2 - (BAR_WIDTH / 2);
    int y = BAR_TOP + i * BAR_SPACE;
    int amount = state.water_level[i] * (BAR_WIDTH - 2) / 1000;
    display.setCursor(x - 16, y + (BAR_HEIGHT / 2) + 6);
    display.setTextColor(COLOR3);
    rightjustify(i == 0 ? "1:" : "2:");
    display.fillRect(x, y, BAR_WIDTH, BAR_HEIGHT, COLOR4);
    display.fillRect(x + 1, y + 1, BAR_WIDTH - 2, BAR_HEIGHT - 2, COLOR1);
#ifdef RAINPUMP_V2
    if (!state.connected_recently) {
      // no recent water level data
      continue;
    }
#endif
    display.fillRect(x + 1, y + 1, amount, BAR_HEIGHT - 2, COLOR2); // the actual graph amount
    display.setTextColor(COLOR4);
    display.setCursor(x + (BAR_WIDTH / 2), y + (BAR_HEIGHT / 2));
    boldface();
    char buf[20];
    snprintf(buf, 20, "%.0f%%", state.water_level[i] / 10.);
    centerjustify(buf);
    normalface();
  }

#define BUTTON_HEIGHT 28
  if (client_connected_recently) {
    display.fillRect(state.user_state * display.width() / 4, display.height() - BUTTON_HEIGHT,
                     display.width() / 4, BUTTON_HEIGHT, COLOR2);
  }
  display.drawFastHLine(0, display.height() - BUTTON_HEIGHT, display.width(), COLOR3);
  for (int i = 0; i < 3; i++) {
    display.drawFastVLine((i + 1)*display.width() / 4, display.height() - BUTTON_HEIGHT, BUTTON_HEIGHT, COLOR3);
  }
  for (int i = 0; i < 3; i++) {
    display.setCursor((2 * i + 1)*display.width() / 8, display.height() - BUTTON_HEIGHT / 2);
    if (!client_connected_recently) {
      display.setTextColor(COLOR2);
      normalface();
    } else if (i == state.user_state) {
      display.setTextColor(COLOR4);
      boldface();
    } else {
      if (i == state.active_state) {
        display.setTextColor(COLOR4);
      } else {
        display.setTextColor(COLOR3);
      }
      normalface();
    }
    centerjustify(i == 0 ? "CITY" : i == 1 ? "AUTO" : "RAIN" );
  }
#define BITMAP4(x, y, w, h, num) BITMAP4_(x,y,w,h,num) // need to expand the _NUM macro before pasting
#define BITMAP4_(x, y, w, h, num) do {\
    display.drawBitmap(x, y, LightBitmap ## num, w, h, COLOR2); \
    display.drawBitmap(x, y, DarkBitmap ## num, w, h, COLOR3); \
    display.drawBitmap(x, y, BlackBitmap ## num, w, h, COLOR4); \
  } while(false)

  if (state.user_state == STATE_AUTO && state.active_state == STATE_CITY && client_connected_recently) {
    BITMAP4(display.width() / 4 - LEFT_ARROW_WIDTH / 2,
            display.height() - BUTTON_HEIGHT / 2 - LEFT_ARROW_HEIGHT / 2,
            LEFT_ARROW_WIDTH,
            LEFT_ARROW_HEIGHT,
            LEFT_ARROW_NUM);
  }
  if (state.user_state == STATE_AUTO && state.active_state == STATE_RAIN && client_connected_recently) {
    BITMAP4(2 * display.width() / 4 - RIGHT_ARROW_WIDTH / 2,
            display.height() - BUTTON_HEIGHT / 2 - RIGHT_ARROW_HEIGHT / 2,
            RIGHT_ARROW_WIDTH,
            RIGHT_ARROW_HEIGHT,
            RIGHT_ARROW_NUM);
  }
  // pipe sensor status
  if (client_connected_recently) {
    if (state.pipe_water_present) {
      BITMAP4(242 - DROP_ON_WIDTH / 2,
              display.height() - BUTTON_HEIGHT / 2 - DROP_ON_HEIGHT / 2,
              DROP_ON_WIDTH, DROP_ON_HEIGHT,
              DROP_ON_NUM);
    } else {
      BITMAP4(242 - DROP_OFF_WIDTH / 2,
              display.height() - BUTTON_HEIGHT / 2 - DROP_OFF_HEIGHT / 2,
              DROP_OFF_WIDTH, DROP_OFF_HEIGHT,
              DROP_OFF_NUM);
    }
  }
  // connection status
  if (state.connected_recently) {
    BITMAP4(274 - CONN_ON_WIDTH / 2,
            display.height() - BUTTON_HEIGHT / 2 - CONN_ON_HEIGHT / 2,
            CONN_ON_WIDTH, CONN_ON_HEIGHT,
            CONN_ON_NUM);
  } else {
    BITMAP4(274 - CONN_OFF_WIDTH / 2,
            display.height() - BUTTON_HEIGHT / 2 - CONN_OFF_HEIGHT / 2,
            CONN_OFF_WIDTH, CONN_OFF_HEIGHT,
            CONN_OFF_NUM);
  }

  display.display(); // or partial update?
}

void loop() {
  ArduinoOTA.handle();
  if (connectionWatchdog.isExpired()) {
    delay(5000);
    ESP.restart();
  }
  if ((!mqtt.connected()) && mqttDelay.isExpired()) {
    int ret = mqtt.connect();
    if (ret != 0) {
      Serial.println(mqtt.connectErrorString(ret));
    }
    mqttDelay.restart();
  }
  // Update user state via buttons
  ButtonPress button_press;
  if (capReadInterval.isExpired()) { // don't clog up the I2C
      capReadInterval.restart();
      cap1298_read_buttons(&button_press);
  } else {
      button_press = lastButtonPress;
  }
#ifdef DISABLE_BUTTONS
  button_press = ButtonPress();
#endif
#ifdef RAINPUMP_V2
  server.handleClient();
  if (WiFi.isConnected()) {
    connectionWatchdog.restart();
  }
  // Update user state via buttons
  if (button_press.a) {
    state.user_state = STATE_CITY;
  } else if (button_press.b) {
    state.user_state = STATE_AUTO;
  } else if (button_press.c) {
    state.user_state = STATE_RAIN;
  } else if (button_press.d) {
    /* no function in server */
  }
  updateState(); // read various sensors
#endif
#ifdef RAINGAUGE_V2
  // read buttons, if pressed immediately sent a ?state= request to the server and expire lastPing()
  if (button_press.a) {
    sendUpdate(STATE_CITY);
    displayMaxRefresh.expire();
  } else if (button_press.b) {
    sendUpdate(STATE_AUTO);
    displayMaxRefresh.expire();
  } else if (button_press.c) {
    sendUpdate(STATE_RAIN);
    displayMaxRefresh.expire();
  } else if (button_press.d) {
    lastPing.expire();
    displayMaxRefresh.expire(); // force refresh
  } else {
    updateState();
  }
#endif
  updateDisplay(); // possibly update display if state has changed
}

#endif /* RAINPUMP_V2 || RAINGAUGE_V2 */
